app/controllers/wklysums_controller.rb

  def index
    @wklysums = Wklysum.all
---
SELECT * FROM `wklysums`

  def show
    @wklysum = Wklysum.find(params[:id])
---
SELECT * FROM `wklysums` WHERE (`wklysums`.`id` = 16)

  def edit
    @wklysum = Wklysum.find(params[:id])
---
SELECT * FROM `wklysums` WHERE (`wklysums`.`id` = 16)

  def create
    @wklysum = Wklysum.new(params[:wklysum])

    respond_to do |format|
      if @wklysum.save
---
INSERT INTO `wklysums` (`dateComposed`, `content`, `created_at`, `updated_at`) VALUES('2010-08-11', '上午：工装复制协调会\r\n下午：\r\n1.清理行动项目并将其加入8月份项目经理检查会。\r\n2.清理WRO\r\n', '2010-08-17 08:50:05', '2010-08-17 08:50:05')