app/controllers/wros_controller.rb

  def index
    @wros = Wro.all
---
SELECT * FROM `wros`